In [1]:
import pandas as pd
df=pd.read_csv('reviews.csv')
df

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     NaN
4       305        NaN           4     5.0

In [2]:
df.shape

(5, 4)

In [3]:
df.head()

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     NaN
4       305        NaN           4     5.0

In [4]:
df.tail(2)

   ReviewID  ProductID  CustomerID  Rating
3       304      204.0           5     NaN
4       305        NaN           4     5.0

In [5]:
df.columns

Index(['ReviewID', 'ProductID', 'CustomerID', 'Rating'], dtype='object')

In [6]:
df.describe

<bound method NDFrame.describe of    ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     NaN
4       305        NaN           4     5.0>

In [7]:
df.info

<bound method DataFrame.info of    ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     NaN
4       305        NaN           4     5.0>

In [30]:
df.isnull()

   ReviewID  ProductID  CustomerID  Rating
0     False      False       False   False
1     False      False       False   False
2     False      False       False   False
3     False      False       False    True
4     False       True       False   False

In [8]:
df[df['ReviewID']==df['ReviewID'].max()]

   ReviewID  ProductID  CustomerID  Rating
4       305        NaN           4     5.0

In [9]:
type[df['Rating']]

type[0    5.0
1    4.0
2    3.0
3    NaN
4    5.0
Name: Rating, dtype: float64]

In [10]:
df[['CustomerID','Rating']]

   CustomerID  Rating
0           1     5.0
1           3     4.0
2           2     3.0
3           5     NaN
4           4     5.0

In [11]:
df['CustomerID'][df['Rating']==4]

1    3
Name: CustomerID, dtype: int64

In [13]:
df[df['Rating']==4]

   ReviewID  ProductID  CustomerID  Rating
1       302      202.0           3     4.0

In [14]:
df[df['Rating']>=3]

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
4       305        NaN           4     5.0

In [15]:
df['ProductID'].max()

204.0

In [16]:
df['ProductID'].min()

201.0

In [17]:
newdf=df.dropna(axis=0)
newdf

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0

In [18]:
newdf=df.dropna(axis=1)
newdf

   ReviewID  CustomerID
0       301           1
1       302           3
2       303           2
3       304           5
4       305           4

In [19]:
newdf=df.fillna(0)   #fills the entire dataset with 0 where we have NaN value
newdf

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     0.0
4       305        0.0           4     5.0

In [21]:
newdf=df.fillna(df['Rating'].max())   #fills the entire dataset with 0 where we have NaN value
newdf

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     5.0
4       305        5.0           4     5.0

In [22]:
newdf=df.fillna({
    'ProductID':0,
    'Rating':'Not given'
    
})
newdf

   ReviewID  ProductID  CustomerID     Rating
0       301      201.0           1        5.0
1       302      202.0           3        4.0
2       303      203.0           2        3.0
3       304      204.0           5  Not given
4       305        0.0           4        5.0

In [23]:
newdf=df.fillna(method='ffill')
newdf

C:\Users\kapul\AppData\Local\Temp\ipykernel_17424\1075770654.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  newdf=df.fillna(method='ffill')

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     3.0
4       305      204.0           4     5.0

In [24]:
newdf=df.fillna(method='bfill')
newdf

C:\Users\kapul\AppData\Local\Temp\ipykernel_17424\1920324291.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  newdf=df.fillna(method='bfill')

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     5.0
4       305        NaN           4     5.0

In [25]:
newdf=df.interpolate()
newdf

   ReviewID  ProductID  CustomerID  Rating
0       301      201.0           1     5.0
1       302      202.0           3     4.0
2       303      203.0           2     3.0
3       304      204.0           5     4.0
4       305      204.0           4     5.0

In [28]:
newdf['additionalcol']=df['CustomerID']+df['ProductID']
newdf
newdf.fillna(df['CustomerID'].max())

   ReviewID  ProductID  CustomerID  Rating  additionalcol
0       301      201.0           1     5.0          202.0
1       302      202.0           3     4.0          205.0
2       303      203.0           2     3.0          205.0
3       304      204.0           5     4.0          209.0
4       305      204.0           4     5.0            5.0

In [29]:
df['Rating'].sum()

17.0